database/load-testing/artillery.yml
config:
  target: "http://localhost:4000"
  plugins:
    metrics-by-endpoint: {}
    publish-metrics:
      - type: datadog
        prefix: 'artillery.publish_metrics_plugin'
        tags:
          - "testId: 1"
          - "reporterType:datadog-agent"
        event:
          priority: low
          tags:
            - "testId: 1"



  phases:
    - duration: 10
      arrivalRate: 75
      name: Warm up
    - duration: 25
      arrivalRate: 1000
      rampTo: 50
      name: Ramp up load
    - duration: 20
      arrivalRate: 100
      name: Sustained load

scenarios:
  - name: "/products/:product_id"
    flow:
      - get:
          url: "/products/{{ $randomNumber(1, 100011) }}"
  - name: "/products/:product_id/styles"
    flow:
      - get:
          url: "/products/{{ $randomNumber(1, 100011) }}/styles"
  - name: "/products"
    flow:
      - get:
          url: "/products"
  - name: "/products/:product_id/features"
    flow:
      - get:
          url: "/products/{{ $randomNumber(1, 100011) }}/features"